karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
/**
 * ============================================================================
 * SMART WATER PUMP CONTROLLER — ESP32 INDUSTRIAL MAIN NODE FIRMWARE
 * ============================================================================
 * Target Hardware: ESP32-WROOM-32 / ESP32 Dev Module
 * Version: v2.2.0 (Production MQTT & Captive Portal Release)
 * Platform: Arduino IDE / PlatformIO
 * 
 * Hardware Pinout:
 *  - GPIO 23: Relay Driver (Opto-Isolated PC817, Active LOW)
 *  - GPIO 34: ACS712 Current Sensor (ADC1_CH6)
 *  - GPIO 18: Manual START / STOP Tactile Push Button
 *  - GPIO 19: Reset Button (Hold 3s -> Factory Reset & Wipe NVS)
 *  - GPIO 2:  Built-in LED / Wi-Fi & MQTT Link Status LED
 *             * BLINKS (500ms) when Searching / Disconnected / Provisioning
 *             * SOLID ON when Connected to Wi-Fi & MQTT Broker
 *  - GPIO 4:  Pump Motor Energized LED (Green)
 *  - GPIO 5:  Power Status LED (Blue)
 *  - GPIO 21: Fault / Lockout LED (Red)
 *  - GPIO 13: Piezo Buzzer Alarm Output
 * 
 * MULTI-CHANNEL ZERO-FRICTION WI-FI & CLOUD MQTT CONNECTIVITY:
 *  1. Automatic SoftAP Hotspot ("AquaControl-Setup", 192.168.4.1):
 *     - Built-in DNS Captive Portal automatically prompts mobile/PC browser.
 *     - Real-time 2.4GHz Wi-Fi Scanner lists all networks in range with signal strength.
 *     - Connects to ANY Wi-Fi SSID and Password in seconds.
 *  2. Cloud MQTT Broker (Default: broker.emqx.io:1883):
 *     - Ultra-reliable public broker accessible from ANY Wi-Fi, 4G, 5G, or Cloud worldwide!
 *     - Topic `devices/WPC-A81F29/telemetry`: ESP32 publishes water level, flow, current every 1s.
 *     - Topic `devices/WPC-A81F29/commands`: ESP32 receives START, STOP, SET_MODE, EMERGENCY_STOP.
 *     - Topic `devices/WPC-A81F29/ack`: ESP32 publishes state confirmation ACK immediately.
 *     - Topic `devices/WPC-A81F29/status`: LWT & online heartbeat messages.
 *  3. Bluetooth Low Energy (BLE GATT): Service UUID: 4fafc201-1fb5-459e-8fcc-c5c9c331914b.
 *  4. USB Serial Provisioning: Send WIFI:MySSID:MyPassword via 115200 baud Serial Monitor.
 *  5. NVS Flash Storage: Credentials survive reboots and power outages.
 * ============================================================================
 */

#include <Arduino.h>
#include <WiFi.h>
#include <DNSServer.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include <PubSubClient.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <esp_now.h>
#include <esp_task_wdt.h>
#include <esp_idf_version.h>
#include <math.h>

// =====================================================================
// HARDWARE DEFINITIONS & CONSTANTS
// =====================================================================
#define FIRMWARE_VERSION       "v2.2.0"

// Dynamic Silicon-Generated Device UID (Derived from ESP32 eFuse MAC Address)
String dynamicDeviceUid = "WPC-A81F29";

void initHardwareDeviceUid() {
    uint8_t mac[6];
    WiFi.macAddress(mac);
    char buf[32];
    snprintf(buf, sizeof(buf), "WPC-%02X%02X%02X", mac[3], mac[4], mac[5]);
    dynamicDeviceUid = String(buf);
    Serial.printf("\n========================================================\n");
    Serial.printf("[HARDWARE SILICON] Generated Dynamic Device UID: %s\n", dynamicDeviceUid.c_str());
    Serial.printf("[HARDWARE SILICON] Silicon MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\n",
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    Serial.printf("========================================================\n\n");
}

#define DEVICE_UID             dynamicDeviceUid.c_str()

#define PIN_RELAY              23
#define PIN_CURRENT_ADC        34
#define PIN_BTN_MANUAL         18
#define PIN_BTN_RESET          19    // Hold 3s -> Wipe credentials & force provision
#define PIN_LED_POWER          5
#define PIN_LED_PUMP           4
#define PIN_LED_WIFI           2     // Built-in LED (GPIO 2): Blinks when disconnected, Solid when connected
#define PIN_LED_FAULT          21
#define PIN_BUZZER             13

#define ACS712_SENSITIVITY     0.066  // 66mV/A for 30A model
#define ACS712_VREF            3.3
#define ACS712_ADC_RES         4095.0
#define ACS712_OFFSET          1.65

#define AUTO_START_LEVEL_PCT   30.0
#define AUTO_STOP_LEVEL_PCT    95.0
#define DRY_RUN_TIMEOUT_SEC    120
#define MAX_RUNTIME_LIMIT_S    7200

// Provisioning Defaults
#define PROVISION_AP_SSID      "AquaControl-Setup"
#define PROVISION_AP_PASS      "setup1234"
#define PROVISION_BLE_NAME     dynamicDeviceUid.c_str()

// Universal Default Settings (Connects globally without local port forwarding)
#define DEFAULT_WIFI_SSID      ""                // Optional: Hardcode your Wi-Fi Name here if desired
#define DEFAULT_WIFI_PASS      ""                // Optional: Hardcode your Wi-Fi Password here
#define DEFAULT_MQTT_BROKER    "broker.emqx.io"  // Public ultra-reliable MQTT broker
#define DEFAULT_MQTT_PORT      1883
#define DEFAULT_SERVER_HOST    "192.168.31.53"   // Optional local LAN Gateway fallback
#define DEFAULT_SERVER_PORT    5000

// BLE Service & Characteristic UUIDs
#define BLE_SERVICE_UUID        "4fafc201-1fb5-459e-8fcc-c5c9c331914b"
#define BLE_CHAR_CONFIG_UUID    "beb5483e-36e1-4688-b7f5-ea07361b26a8"
#define BLE_CHAR_INFO_UUID      "beb5483e-36e1-4688-b7f5-ea07361b26a9"
#define BLE_CHAR_STATUS_UUID    "beb5483e-36e1-4688-b7f5-ea07361b26aa"

// Binary ESP-NOW Telemetry Packet (35 Bytes)
typedef struct __attribute__((packed)) {
    uint8_t  magic;           // 0xAA
    uint8_t  node_id;         // 0x01
    uint32_t sequence_num;
    float    water_level_pct;
    float    water_liters;
    float    flow_rate_lpm;
    float    total_inflow_l;
    float    tds_ppm;
    float    temperature_c;
    uint8_t  sensor_health;
    uint16_t battery_mv;
    uint16_t crc16;
} TankTelemetryPacket;

// Dynamic Autonomous Rule Structure (Synchronized from Cloud & Frontend)
struct DynamicRule {
    char id[37];
    char rule_name[64];
    bool enabled;
    float level_lt; // -1 if not set
    float level_gt; // -1 if not set
    uint16_t no_flow_sec; // 0 if not set
    char action[16]; // "START", "STOP", "EMERGENCY_STOP"
    uint8_t priority;
};

#define MAX_DYNAMIC_RULES 12
DynamicRule dynamicRules[MAX_DYNAMIC_RULES];
uint8_t dynamicRuleCount = 0;
bool waterLevelSensorFault = false;

// =====================================================================
// GLOBAL OBJECTS & STATE
// =====================================================================
Preferences preferences;
WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);
WebServer localServer(80);
DNSServer dnsServer;

String wifiSsid = DEFAULT_WIFI_SSID;
String wifiPass = DEFAULT_WIFI_PASS;
String mqttBroker = DEFAULT_MQTT_BROKER;
int mqttPort = DEFAULT_MQTT_PORT;
String apiServerHost = DEFAULT_SERVER_HOST;
int apiServerPort = DEFAULT_SERVER_PORT;
String authCode = "WPC_AUTH_SECURE_KEY_2026";

volatile bool wifiConnected = false;
volatile bool mqttConnected = false;
uint32_t lastWifiCheck = 0;
uint32_t lastMqttCheck = 0;
uint32_t lastLedBlinkTime = 0;
bool ledWifiState = false;

volatile bool pumpState = false;
String pumpMode = "AUTOMATIC";
uint32_t pumpStartMillis = 0;
uint32_t totalRuntimeSeconds = 0;
float currentAmps = 0.0;
bool systemFault = false;
String faultReason = "";

TankTelemetryPacket latestTankData;
volatile bool newTankDataAvailable = false;
uint32_t lastSubNodePacketTime = 0;
bool subNodeConnected = false;

TaskHandle_t TaskSafetyHandle = NULL;
TaskHandle_t TaskNetworkHandle = NULL;

BLEServer* pBleServer = NULL;
BLECharacteristic* pBleStatusChar = NULL;
bool bleConnected = false;

// Forward Declarations
void loadSavedCredentials();
void loadSavedRules();
void saveRulesToNvs();
void saveCredentials(const String& ssid, const String& pass, const String& broker, int mPort, const String& host, int aPort, const String& auth);
void handleApplyCredentials(const String& jsonString);
void startBleProvisioning();
void setupHttpEndpoints();
void setPumpState(bool state, const char* initiator, const char* cmdId = "");
void triggerEmergencyStop(const char* reason, const char* cmdId = "");
void sendHttpStateAck(const char* state, const char* initiator, const char* cmdId = "");
void sendHttpTelemetry();
void publishHardwareAck(const char* state, const char* initiator, const char* cmdId = "");
void onMqttMessage(char* topic, byte* payload, unsigned int length);
uint16_t calculateCrc16(const uint8_t *data, size_t length);

// =====================================================================
// 1. NVS FLASH CREDENTIAL & RULES STORAGE
// =====================================================================
void loadSavedRules() {
    preferences.begin("pump_rules", true);
    dynamicRuleCount = preferences.getUInt("rule_cnt", 0);
    if (dynamicRuleCount > MAX_DYNAMIC_RULES) dynamicRuleCount = 0;
    
    for (uint8_t i = 0; i < dynamicRuleCount; i++) {
        char keyPrefix[16];
        snprintf(keyPrefix, sizeof(keyPrefix), "r_%d_", i);
        
        String rId = preferences.getString((String(keyPrefix) + "id").c_str(), "");
        String rName = preferences.getString((String(keyPrefix) + "name").c_str(), "");
        String rAct = preferences.getString((String(keyPrefix) + "act").c_str(), "START");
        
