karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
        strncpy(dynamicRules[i].id, rId.c_str(), sizeof(dynamicRules[i].id) - 1);
        strncpy(dynamicRules[i].rule_name, rName.c_str(), sizeof(dynamicRules[i].rule_name) - 1);
        strncpy(dynamicRules[i].action, rAct.c_str(), sizeof(dynamicRules[i].action) - 1);
        
        dynamicRules[i].enabled = preferences.getBool((String(keyPrefix) + "en").c_str(), true);
        dynamicRules[i].level_lt = preferences.getFloat((String(keyPrefix) + "lt").c_str(), -1.0f);
        dynamicRules[i].level_gt = preferences.getFloat((String(keyPrefix) + "gt").c_str(), -1.0f);
        dynamicRules[i].no_flow_sec = preferences.getUInt((String(keyPrefix) + "nf").c_str(), 0);
        dynamicRules[i].priority = preferences.getUInt((String(keyPrefix) + "pr").c_str(), 1);
    }
    preferences.end();
    
    // Default fallback rules if no custom rules configured yet
    if (dynamicRuleCount == 0) {
        dynamicRuleCount = 3;
        
        strncpy(dynamicRules[0].id, "rule_default_start", 36);
        strncpy(dynamicRules[0].rule_name, "Low Level Refill (Start < 30%)", 63);
        strncpy(dynamicRules[0].action, "START", 15);
        dynamicRules[0].enabled = true;
        dynamicRules[0].level_lt = 30.0f;
        dynamicRules[0].level_gt = -1.0f;
        dynamicRules[0].no_flow_sec = 0;
        dynamicRules[0].priority = 1;
        
        strncpy(dynamicRules[1].id, "rule_default_stop", 36);
        strncpy(dynamicRules[1].rule_name, "High Level Cutoff (Stop >= 95%)", 63);
        strncpy(dynamicRules[1].action, "STOP", 15);
        dynamicRules[1].enabled = true;
        dynamicRules[1].level_lt = -1.0f;
        dynamicRules[1].level_gt = 95.0f;
        dynamicRules[1].no_flow_sec = 0;
        dynamicRules[1].priority = 1;
        
        strncpy(dynamicRules[2].id, "rule_default_dryrun", 36);
        strncpy(dynamicRules[2].rule_name, "Borewell Dry Run Protection", 63);
        strncpy(dynamicRules[2].action, "EMERGENCY_STOP", 15);
        dynamicRules[2].enabled = true;
        dynamicRules[2].level_lt = -1.0f;
        dynamicRules[2].level_gt = -1.0f;
        dynamicRules[2].no_flow_sec = 120;
        dynamicRules[2].priority = 0;
    }
    
    Serial.printf("[RULES] Loaded %d dynamic autonomous edge rules from NVS\n", dynamicRuleCount);
}

void saveRulesToNvs() {
    preferences.begin("pump_rules", false);
    preferences.clear();
    preferences.putUInt("rule_cnt", dynamicRuleCount);
    for (uint8_t i = 0; i < dynamicRuleCount; i++) {
        char keyPrefix[16];
        snprintf(keyPrefix, sizeof(keyPrefix), "r_%d_", i);
        preferences.putString((String(keyPrefix) + "id").c_str(), dynamicRules[i].id);
        preferences.putString((String(keyPrefix) + "name").c_str(), dynamicRules[i].rule_name);
        preferences.putString((String(keyPrefix) + "act").c_str(), dynamicRules[i].action);
        preferences.putBool((String(keyPrefix) + "en").c_str(), dynamicRules[i].enabled);
        preferences.putFloat((String(keyPrefix) + "lt").c_str(), dynamicRules[i].level_lt);
        preferences.putFloat((String(keyPrefix) + "gt").c_str(), dynamicRules[i].level_gt);
        preferences.putUInt((String(keyPrefix) + "nf").c_str(), dynamicRules[i].no_flow_sec);
        preferences.putUInt((String(keyPrefix) + "pr").c_str(), dynamicRules[i].priority);
    }
    preferences.end();
    Serial.printf("[RULES] Saved %d dynamic edge rules to NVS\n", dynamicRuleCount);
}

void loadSavedCredentials() {
    preferences.begin("pump_cfg", true);
    wifiSsid      = preferences.getString("ssid", DEFAULT_WIFI_SSID);
    wifiPass      = preferences.getString("pass", DEFAULT_WIFI_PASS);
    mqttBroker    = preferences.getString("mqtt_host", DEFAULT_MQTT_BROKER);
    mqttPort      = preferences.getInt("mqtt_port", DEFAULT_MQTT_PORT);
    apiServerHost = preferences.getString("api_host", DEFAULT_SERVER_HOST);
    apiServerPort = preferences.getInt("api_port", DEFAULT_SERVER_PORT);
    authCode      = preferences.getString("auth_code", "UNPROVISIONED");
    preferences.end();

    if (wifiSsid.length() == 0 && strlen(DEFAULT_WIFI_SSID) > 0) {
        wifiSsid = DEFAULT_WIFI_SSID;
        wifiPass = DEFAULT_WIFI_PASS;
    }
    if (mqttBroker.length() == 0) {
        mqttBroker = DEFAULT_MQTT_BROKER;
    }

    loadSavedRules();

    Serial.printf("[NVS] Loaded config: SSID='%s', MQTT=%s:%d, API=%s:%d, Auth='%s'\n",
        wifiSsid.c_str(), mqttBroker.c_str(), mqttPort, apiServerHost.c_str(), apiServerPort, authCode.c_str());
}

void saveCredentials(const String& ssid, const String& pass, const String& broker, int mPort, const String& host, int aPort, const String& auth) {
    preferences.begin("pump_cfg", false);
    preferences.putString("ssid", ssid);
    preferences.putString("pass", pass);
    if (broker.length() > 0) preferences.putString("mqtt_host", broker);
    if (mPort > 0) preferences.putInt("mqtt_port", mPort);
    if (host.length() > 0) preferences.putString("api_host", host);
    if (aPort > 0) preferences.putInt("api_port", aPort);
    if (auth.length() > 0) preferences.putString("auth_code", auth);
    preferences.end();
    Serial.printf("[NVS] Configuration saved to flash: SSID='%s', MQTT='%s:%d', Auth='%s'\n", ssid.c_str(), broker.c_str(), mPort, auth.c_str());
}

// =====================================================================
// 2. CREDENTIAL INGESTION (Shared by BLE, Captive Portal & Serial CLI)
// =====================================================================
const char* getWifiStatusText(wl_status_t status) {
    switch (status) {
        case WL_IDLE_STATUS:     return "IDLE (Initializing)";
        case WL_NO_SSID_AVAIL:   return "NO SSID AVAIL (Network not found - check 2.4GHz)";
        case WL_SCAN_COMPLETED:  return "SCAN COMPLETED";
        case WL_CONNECTED:       return "CONNECTED";
        case WL_CONNECT_FAILED:  return "CONNECT FAILED (Check password / auth)";
        case WL_CONNECTION_LOST: return "CONNECTION LOST";
        case WL_DISCONNECTED:    return "DISCONNECTED (Attempting handshake)";
        default:                 return "UNKNOWN STATUS";
    }
}

