karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
void handleApplyCredentials(const String& rawInput) {
    String input = rawInput;
    input.trim();
    Serial.printf("[PROVISION] Ingesting credentials (%d bytes): %s\n", input.length(), input.c_str());

    String newSsid = "";
    String newPass = "";
    String newBroker = DEFAULT_MQTT_BROKER;
    int mPortVal = DEFAULT_MQTT_PORT;
    String newHost = DEFAULT_SERVER_HOST;
    int portVal = DEFAULT_SERVER_PORT;
    String newAuth = "UNPROVISIONED";

    // Format 1: Text format "WIFI:SSID:PASS" or "WIFI:SSID:PASS:BROKER"
    if (input.startsWith("WIFI:") || input.startsWith("wifi:")) {
        int firstColon = input.indexOf(':', 5);
        if (firstColon > 0) {
            newSsid = input.substring(5, firstColon);
            int secondColon = input.indexOf(':', firstColon + 1);
            newPass = (secondColon > 0) ? input.substring(firstColon + 1, secondColon) : input.substring(firstColon + 1);
            if (secondColon > 0) {
                newBroker = input.substring(secondColon + 1);
            }
        }
    } else {
        // Format 2: JSON payload (supports compact and full keys)
        StaticJsonDocument<512> doc;
        DeserializationError err = deserializeJson(doc, input);
        if (!err) {
            const char* sVal = doc["s"] | doc["ssid"] | doc["wifi_ssid"] | "";
            const char* pVal = doc["p"] | doc["password"] | doc["wifi_password"] | doc["pass"] | "";
            const char* bVal = doc["b"] | doc["mqtt_broker"] | doc["mqtt_host"] | doc["broker"] | DEFAULT_MQTT_BROKER;
            const char* hVal = doc["h"] | doc["server_host"] | doc["api_host"] | bVal;
            const char* aVal = doc["auth_code"] | doc["auth"] | doc["auth_token"] | doc["user_auth_id"] | "";

            newSsid = String(sVal);
            newPass = String(pVal);
            newBroker = String(bVal);
            mPortVal = doc["mqtt_port"] | DEFAULT_MQTT_PORT;
            newHost = String(hVal);
            portVal = doc["port"] | doc["server_port"] | doc["api_port"] | DEFAULT_SERVER_PORT;
            if (strlen(aVal) > 0) {
                newAuth = String(aVal);
            }
        } else {
            Serial.printf("[PROVISION] JSON parse error: %s (Raw payload: '%s')\n", err.c_str(), input.c_str());
            return;
        }
    }

    newSsid.trim();
    newPass.trim();

    if (newSsid.length() == 0) {
        Serial.println("[PROVISION] Error: Empty SSID received! Wi-Fi connection cancelled.");
        return;
    }

    wifiSsid = newSsid;
    wifiPass = newPass;
    mqttBroker = (newBroker.length() > 0) ? newBroker : DEFAULT_MQTT_BROKER;
    mqttPort = mPortVal;
    apiServerHost = (newHost.length() > 0) ? newHost : DEFAULT_SERVER_HOST;
    apiServerPort = portVal;
    authCode = (newAuth.length() > 0) ? newAuth : "WPC_AUTH_SECURE_KEY_2026";

    // Save permanently to NVS Flash
    saveCredentials(wifiSsid, wifiPass, mqttBroker, mqttPort, apiServerHost, apiServerPort, authCode);

    // Reset Wi-Fi check timer so background task does not interrupt connection
    lastWifiCheck = millis();

    // Audible confirmation beeps
    for (int i = 0; i < 2; i++) {
        digitalWrite(PIN_BUZZER, HIGH); delay(80);
        digitalWrite(PIN_BUZZER, LOW);  delay(80);
    }

    Serial.printf("[PROVISION] ✓ Credentials Saved! Connecting to Wi-Fi SSID: '%s' (Password length: %d chars) | Broker: '%s:%d'...\n",
        wifiSsid.c_str(), wifiPass.length(), mqttBroker.c_str(), mqttPort);

    // Reset connection and start STA handshake with power save disabled
    WiFi.disconnect(true);
    delay(100);
    WiFi.mode(WIFI_AP_STA);
    WiFi.setSleep(false); // Prevent modem sleep from dropping handshakes
    WiFi.setAutoReconnect(true);
    WiFi.begin(wifiSsid.c_str(), wifiPass.c_str());

    // Notify BLE client if connected
    if (pBleStatusChar) {
        String resp = "{\"status\":\"configured\",\"ssid\":\"" + wifiSsid + "\",\"mqtt\":\"" + mqttBroker + "\",\"reconnecting\":true}";
        pBleStatusChar->setValue(resp.c_str());
        pBleStatusChar->notify();
    }
}

// =====================================================================
// 3. BLUETOOTH LOW ENERGY (BLE GATT SERVER)
// =====================================================================
class BleServerCallbacksImpl : public BLEServerCallbacks {
    void onConnect(BLEServer* pServer) {
        bleConnected = true;
        Serial.println("[BLE] Client connected from App!");
    }
    void onDisconnect(BLEServer* pServer) {
        bleConnected = false;
        Serial.println("[BLE] Client disconnected.");
        pServer->startAdvertising();
    }
};

class BleConfigCallbacksImpl : public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* pChar) {
        String val = String(pChar->getValue().c_str());
        if (val.length() > 0) {
            handleApplyCredentials(val);
        }
    }
};

void startBleProvisioning() {
    Serial.println("[BLE] Initializing standard ESP32 BLE GATT Server...");
    BLEDevice::init(PROVISION_BLE_NAME);
    
    pBleServer = BLEDevice::createServer();
    pBleServer->setCallbacks(new BleServerCallbacksImpl());

    BLEService* pService = pBleServer->createService(BLEUUID(BLE_SERVICE_UUID));

    // Characteristic 1: Config (Write)
    BLECharacteristic* pConfigChar = pService->createCharacteristic(
        BLEUUID(BLE_CHAR_CONFIG_UUID),
        BLECharacteristic::PROPERTY_READ |
        BLECharacteristic::PROPERTY_WRITE |
        BLECharacteristic::PROPERTY_WRITE_NR
    );
    pConfigChar->setCallbacks(new BleConfigCallbacksImpl());

    // Characteristic 2: Device Info (Read)
    BLECharacteristic* pInfoChar = pService->createCharacteristic(
        BLEUUID(BLE_CHAR_INFO_UUID),
        BLECharacteristic::PROPERTY_READ
    );
    String info = "{\"uid\":\"" + String(DEVICE_UID) + "\",\"fw\":\"" + String(FIRMWARE_VERSION) + "\",\"mac\":\"" + WiFi.macAddress() + "\"}";
    pInfoChar->setValue(info.c_str());

    // Characteristic 3: Status (Read + Notify)
    pBleStatusChar = pService->createCharacteristic(
        BLEUUID(BLE_CHAR_STATUS_UUID),
        BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_NOTIFY
    );
    pBleStatusChar->addDescriptor(new BLE2902());
    pBleStatusChar->setValue("{\"status\":\"ready_for_credentials\"}");

