karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
    pService->start();

    BLEAdvertising* pAdvertising = BLEDevice::getAdvertising();
    pAdvertising->addServiceUUID(BLEUUID(BLE_SERVICE_UUID));
    pAdvertising->setScanResponse(true);
    pAdvertising->setMinPreferred(0x06);
    pAdvertising->setMinPreferred(0x12);
    BLEDevice::startAdvertising();

    Serial.printf("[BLE] ✓ BLE Beacon Active: '%s' | Service: %s (MTU: 517)\n", PROVISION_BLE_NAME, BLE_SERVICE_UUID);
}

// =====================================================================
// 4. CAPTIVE PORTAL & LOCAL HTTP REST SERVER (Port 80 with CORS)
// =====================================================================
const char CAPTIVE_HTML[] PROGMEM = R"rawhtml(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>AquaControl Setup</title><style>
*{margin:0;padding:0;box-sizing:border-box}
body{font-family:system-ui,-apple-system,sans-serif;background:#0f172a;color:#f8fafc;display:flex;align-items:center;justify-content:center;min-height:100vh;padding:16px}
.box{background:#1e293b;border-radius:24px;padding:28px;max-width:400px;width:100%;box-shadow:0 20px 25px -5px rgba(0,0,0,0.5),0 8px 10px -6px rgba(0,0,0,0.5);border:1px solid #334155}
h2{color:#38bdf8;font-size:22px;text-align:center;font-weight:800;letter-spacing:-0.5px}
.sub{font-size:12px;color:#94a3b8;text-align:center;margin-top:4px;margin-bottom:20px}
label{font-size:11px;font-weight:700;color:#94a3b8;text-transform:uppercase;margin-top:14px;display:block;letter-spacing:0.5px}
input,select{width:100%;padding:12px;border-radius:12px;background:#0f172a;color:#f8fafc;font-size:14px;margin-top:4px;outline:none;border:1px solid #334155;transition:border-color .2s}
input:focus,select:focus{border-color:#38bdf8}
.btn-scan{width:100%;padding:10px;margin-top:8px;border-radius:10px;background:#334155;color:#e2e8f0;font-size:12px;font-weight:700;border:none;cursor:pointer;display:flex;align-items:center;justify-content:center;gap:6px}
.btn-submit{width:100%;padding:14px;margin-top:24px;border:none;border-radius:14px;background:linear-gradient(135deg,#0284c7,#0ea5e9);color:#ffffff;font-weight:800;font-size:14px;cursor:pointer;text-transform:uppercase;box-shadow:0 4px 12px rgba(14,165,233,0.3)}
.btn-submit:disabled{opacity:0.6;cursor:not-allowed}
.ok{display:none;background:#064e3b;color:#34d399;border:1px solid #059669;border-radius:14px;padding:16px;text-align:center;margin-top:16px;font-weight:700;font-size:13px}
.badge{display:inline-block;padding:2px 8px;border-radius:6px;background:#334155;color:#38bdf8;font-size:11px;font-weight:700}
</style></head><body>
<div class="box">
  <h2>AquaControl IoT Setup</h2>
  <p class="sub">Hardware Node: <span class="badge">WPC-A81F29</span></p>

  <form id="cfgForm" onsubmit="return submitConfig()">
    <label>Select Wi-Fi Network</label>
    <select id="ssidSelect" onchange="onSelectSsid()">
      <option value="">-- Choose or type network name below --</option>
    </select>
    <button type="button" class="btn-scan" id="scanBtn" onclick="scanWifi()">📡 Scan Available 2.4GHz Wi-Fi</button>

    <label>Wi-Fi SSID (Network Name)</label>
    <input type="text" id="ssidInput" required placeholder="Enter Wi-Fi SSID">

    <label>Wi-Fi Password</label>
    <input type="password" id="passInput" placeholder="Enter Wi-Fi Password">

    <label>Account Auth Code (From App Dashboard)</label>
    <input type="text" id="authInput" placeholder="e.g. WPC-AUTH-USRKARTHIKADMIN0">

    <label>MQTT Cloud Broker</label>
    <input type="text" id="brokerInput" value="broker.emqx.io" required placeholder="e.g. broker.emqx.io">

    <button type="submit" class="btn-submit" id="saveBtn">Save & Connect to Cloud</button>
  </form>

  <div class="ok" id="okBox">
    ✓ Settings Saved to ESP32 Flash!<br>Connecting to Wi-Fi and Cloud MQTT...
  </div>
</div>

<script>
function scanWifi() {
  var btn = document.getElementById('scanBtn');
  btn.textContent = '⏳ Scanning nearby networks...';
  btn.disabled = true;
  fetch('/api/v1/wifi/scan').then(function(r){ return r.json(); }).then(function(data){
    var sel = document.getElementById('ssidSelect');
    sel.innerHTML = '<option value="">-- Select from scanned networks --</option>';
    if (data.networks && data.networks.length > 0) {
      data.networks.forEach(function(net){
        var opt = document.createElement('option');
        opt.value = net.ssid;
        opt.textContent = net.ssid + ' (' + net.rssi + ' dBm)' + (net.secure ? ' 🔒' : ' 🔓');
        sel.appendChild(opt);
      });
    }
    btn.textContent = '✓ ' + (data.networks ? data.networks.length : 0) + ' Networks Found. Scan Again';
    btn.disabled = false;
  }).catch(function(){
    btn.textContent = '📡 Scan Available 2.4GHz Wi-Fi';
    btn.disabled = false;
  });
}

function onSelectSsid() {
  var sel = document.getElementById('ssidSelect');
  if (sel.value) {
    document.getElementById('ssidInput').value = sel.value;
  }
}

function submitConfig() {
  var s = document.getElementById('ssidInput').value.trim();
  var p = document.getElementById('passInput').value;
  var a = document.getElementById('authInput').value.trim();
  var b = document.getElementById('brokerInput').value.trim() || 'broker.emqx.io';
  
  if (!s) { alert('Please enter Wi-Fi SSID'); return false; }
  
  var payload = { ssid: s, password: p, mqtt_broker: b, mqtt_port: 1883, auth_code: a, auth: a };
  document.getElementById('saveBtn').textContent = 'CONNECTING...';
  document.getElementById('saveBtn').disabled = true;

  fetch('/api/v1/wifi/config', {
    method: 'POST',
    headers: { 'Content-Type': 'application/json' },
    body: JSON.stringify(payload)
  }).then(function(){
    document.getElementById('cfgForm').style.display = 'none';
    document.getElementById('okBox').style.display = 'block';
  }).catch(function(){
    document.getElementById('cfgForm').style.display = 'none';
    document.getElementById('okBox').style.display = 'block';
  });
  return false;
}

