karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
// Auto scan on load
window.addEventListener('load', function(){ scanWifi(); });
</script>
</body></html>
)rawhtml";

void setCorsHeaders() {
    localServer.sendHeader("Access-Control-Allow-Origin", "*");
    localServer.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
    localServer.sendHeader("Access-Control-Allow-Headers", "Content-Type, Authorization");
}

void setupHttpEndpoints() {
    // 1. CORS Preflight Handlers
    auto handleOptions = []() { setCorsHeaders(); localServer.send(204, "text/plain", ""); };
    localServer.on("/api/v1/wifi/config", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/wifi/scan", HTTP_OPTIONS, handleOptions);
    localServer.on("/provision", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/pump/control", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/devices", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/sensors/latest", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/pumps/status", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/pumps/start", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/pumps/stop", HTTP_OPTIONS, handleOptions);
    localServer.on("/api/v1/pumps/emergency-stop", HTTP_OPTIONS, handleOptions);

    // 2. Captive Portal Root Page
    localServer.on("/", HTTP_GET, []() {
        localServer.send(200, "text/html", CAPTIVE_HTML);
    });

    // 3. Wi-Fi Scanner Endpoint
    localServer.on("/api/v1/wifi/scan", HTTP_GET, []() {
        setCorsHeaders();
        int n = WiFi.scanNetworks();
        StaticJsonDocument<1024> doc;
        JsonArray arr = doc.createNestedArray("networks");
        for (int i = 0; i < n; ++i) {
            JsonObject net = arr.createNestedObject();
            net["ssid"] = WiFi.SSID(i);
            net["rssi"] = WiFi.RSSI(i);
            net["secure"] = (WiFi.encryptionType(i) != WIFI_AUTH_OPEN);
        }
        String res;
        serializeJson(doc, res);
        localServer.send(200, "application/json", res);
    });

    // 4. Wi-Fi Config Endpoint
    auto handleWifiConfig = []() {
        setCorsHeaders();
        String body = localServer.arg("plain");
        localServer.send(200, "application/json", "{\"success\":true,\"message\":\"Credentials received. Applying...\"}");
        handleApplyCredentials(body);
    };

    localServer.on("/api/v1/wifi/config", HTTP_POST, handleWifiConfig);
    localServer.on("/provision", HTTP_POST, handleWifiConfig);

    // 5. REST: /api/v1/devices (Web App Device Sync)
    localServer.on("/api/v1/devices", HTTP_GET, []() {
        setCorsHeaders();
        StaticJsonDocument<512> doc;
        JsonArray arr = doc.to<JsonArray>();
        JsonObject dev = arr.createNestedObject();
        dev["id"] = "97511f3d-e3b7-4b75-876f-b11b259f86d5";
        dev["device_uid"] = DEVICE_UID;
        dev["name"] = "Main Submersible Pump";
        dev["device_name"] = "Main Submersible Pump";
        dev["status"] = (WiFi.status() == WL_CONNECTED) ? "online" : "offline";
        dev["is_online"] = (WiFi.status() == WL_CONNECTED);
        dev["tank_capacity_liters"] = 2000;
        dev["firmware_version"] = FIRMWARE_VERSION;
        dev["hardware_model"] = "ESP32-WROOM-32";
        dev["ip_address"] = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();

        String res;
        serializeJson(doc, res);
        localServer.send(200, "application/json", res);
    });

    // 6. REST: /api/v1/sensors/latest & /api/v1/status
    auto handleSensorsLatest = []() {
        setCorsHeaders();
        StaticJsonDocument<512> doc;
        doc["id"] = "sen_live";
        doc["device_id"] = "97511f3d-e3b7-4b75-876f-b11b259f86d5";
        doc["device_uid"] = DEVICE_UID;
        doc["water_level_percentage"] = latestTankData.water_level_pct;
        doc["water_level_liters"] = latestTankData.water_liters;
        doc["inflow_rate_lpm"] = latestTankData.flow_rate_lpm;
        doc["flow_rate_lpm"] = latestTankData.flow_rate_lpm;
        doc["total_inflow_liters"] = latestTankData.total_inflow_l;
        doc["tds_ppm"] = latestTankData.tds_ppm;
        doc["temperature_c"] = latestTankData.temperature_c;
        doc["sensor_status"] = "HEALTHY";
        doc["pump_running"] = pumpState;
        doc["current_amps"] = currentAmps;
        doc["subnode_online"] = subNodeConnected;
        doc["wifi_connected"] = (WiFi.status() == WL_CONNECTED);
        doc["mqtt_connected"] = mqttClient.connected();
        doc["ip_address"] = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();

        String res;
        serializeJson(doc, res);
        localServer.send(200, "application/json", res);
    };

    localServer.on("/api/v1/sensors/latest", HTTP_GET, handleSensorsLatest);
    localServer.on("/api/v1/status", HTTP_GET, handleSensorsLatest);

    // 7. REST: /api/v1/pumps/status
    localServer.on("/api/v1/pumps/status", HTTP_GET, []() {
        setCorsHeaders();
        StaticJsonDocument<256> doc;
        doc["id"] = "ps_live";
        doc["device_id"] = "97511f3d-e3b7-4b75-876f-b11b259f86d5";
        doc["pump_state"] = pumpState ? "ON" : "OFF";
        doc["mode"] = pumpMode;
        doc["current_draw_amps"] = currentAmps;
        doc["runtime_seconds"] = totalRuntimeSeconds;
        doc["changed_at"] = "live";
        doc["changed_by"] = "ESP32_FIRMWARE";

        String res;
        serializeJson(doc, res);
        localServer.send(200, "application/json", res);
    });

    // 8. REST: Direct Local Pump Control Endpoints (/api/v1/pumps/start, /stop, /emergency-stop, /control)
    localServer.on("/api/v1/pumps/start", HTTP_POST, []() {
        setCorsHeaders();
        systemFault = false;
        digitalWrite(PIN_LED_FAULT, LOW);
        setPumpState(true, "LOCAL_REST_API");
        localServer.send(200, "application/json", "{\"success\":true,\"pump_state\":\"ON\"}");
    });

    localServer.on("/api/v1/pumps/stop", HTTP_POST, []() {
        setCorsHeaders();
        setPumpState(false, "LOCAL_REST_API");
        localServer.send(200, "application/json", "{\"success\":true,\"pump_state\":\"OFF\"}");
    });

    localServer.on("/api/v1/pumps/emergency-stop", HTTP_POST, []() {
        setCorsHeaders();
        triggerEmergencyStop("Local REST Emergency Command");
        localServer.send(200, "application/json", "{\"success\":true,\"status\":\"EMERGENCY_STOP\"}");
    });

    localServer.on("/api/v1/pump/control", HTTP_POST, []() {
        setCorsHeaders();
        String body = localServer.arg("plain");
        StaticJsonDocument<256> doc;
        deserializeJson(doc, body);
        const char* actionVal = doc["action"] | doc["command_type"] | doc["state"] | "";
        String action = String(actionVal);

        if (action == "START" || action == "START_PUMP" || action == "ON") {
            systemFault = false;
            digitalWrite(PIN_LED_FAULT, LOW);
            setPumpState(true, "LOCAL_REST_API");
            localServer.send(200, "application/json", "{\"success\":true,\"pump_state\":\"ON\"}");
        } else if (action == "STOP" || action == "STOP_PUMP" || action == "OFF") {
            setPumpState(false, "LOCAL_REST_API");
            localServer.send(200, "application/json", "{\"success\":true,\"pump_state\":\"OFF\"}");
        } else if (action == "EMERGENCY_STOP") {
            triggerEmergencyStop("Local Emergency Command");
            localServer.send(200, "application/json", "{\"success\":true,\"status\":\"EMERGENCY_STOP\"}");
        } else if (action == "CLEAR_FAULT") {
            systemFault = false;
            digitalWrite(PIN_LED_FAULT, LOW);
            localServer.send(200, "application/json", "{\"success\":true,\"status\":\"FAULT_CLEARED\"}");
        } else {
            localServer.send(400, "application/json", "{\"success\":false,\"error\":\"Invalid action\"}");
        }
    });

    // 9. Captive Portal Fallback Redirect
    localServer.onNotFound([]() {
        setCorsHeaders();
        localServer.sendHeader("Location", "http://192.168.4.1/", true);
        localServer.send(302, "text/plain", "Redirecting to AquaControl setup...");
    });

    localServer.begin();
    Serial.println("[HTTP] ✓ Local REST Server & Captive Portal active on port 80");
}

// =====================================================================
// 5. CRC16-CCITT CHECKSUM
// =====================================================================
uint16_t calculateCrc16(const uint8_t *data, size_t length) {
    uint16_t crc = 0xFFFF;
    for (size_t i = 0; i < length; i++) {
        crc ^= (uint16_t)data[i] << 8;
        for (uint8_t j = 0; j < 8; j++) {
            if (crc & 0x8000) crc = (crc << 1) ^ 0x1021;
            else crc <<= 1;
        }
    }
    return crc;
}

// =====================================================================
// 6. RELAY & PUMP DRIVER
// =====================================================================
void setPumpState(bool state, const char* initiator, const char* cmdId) {
    // If command is from user / operator / MQTT / web / physical button, allow manual override
    bool isManualCommand = (initiator && (
        strstr(initiator, "MQTT") != NULL ||
        strstr(initiator, "WEB") != NULL ||
        strstr(initiator, "USER") != NULL ||
        strstr(initiator, "OPERATOR") != NULL ||
        strstr(initiator, "BUTTON") != NULL ||
        strstr(initiator, "LOCAL_REST") != NULL ||
        strstr(initiator, "MANUAL") != NULL
    ));

    // High-Level Cutoff Lock: Only blocks automatic rule starts when tank is full
    if (state && !isManualCommand && pumpMode == "AUTOMATIC" && latestTankData.water_level_pct >= AUTO_STOP_LEVEL_PCT) {
        Serial.printf("[PUMP] Rejected auto-start in AUTOMATIC mode: Tank level %.1f%% >= %.1f%% cutoff\n",
            latestTankData.water_level_pct, AUTO_STOP_LEVEL_PCT);
        publishHardwareAck("OFF", "AUTO_HIGH_CUTOFF_LOCKED", cmdId);
        sendHttpStateAck("OFF", "AUTO_HIGH_CUTOFF_LOCKED", cmdId);
        return;
    }

    if (state && systemFault) {
        systemFault = false;
        digitalWrite(PIN_LED_FAULT, LOW);
    }

    pumpState = state;
    if (state) {
        digitalWrite(PIN_RELAY, LOW); // Active LOW Opto-coupler (Energize Relay)
        digitalWrite(PIN_LED_PUMP, HIGH);
        pumpStartMillis = millis();
        Serial.printf("[PUMP] ENERGIZED (Active LOW) by %s\n", initiator);
    } else {
        digitalWrite(PIN_RELAY, HIGH); // De-energize
        digitalWrite(PIN_LED_PUMP, LOW);
        pumpStartMillis = 0;
        Serial.printf("[PUMP] DE-ENERGIZED by %s\n", initiator);
    }

    publishHardwareAck(state ? "ON" : "OFF", initiator, cmdId);

    // Immediate 0ms Telemetry Stream Update
    if (mqttClient.connected()) {
        StaticJsonDocument<512> doc;
        doc["device_uid"] = DEVICE_UID;
        doc["timestamp"] = millis() / 1000;
        doc["water_level_percentage"] = latestTankData.water_level_pct;
        doc["water_level_pct"] = latestTankData.water_level_pct;
        doc["water_level_liters"] = latestTankData.water_liters;
        doc["flow_rate_lpm"] = latestTankData.flow_rate_lpm;
        doc["inflow_rate_lpm"] = latestTankData.flow_rate_lpm;
        doc["total_inflow_liters"] = latestTankData.total_inflow_l;
        doc["tds_ppm"] = latestTankData.tds_ppm;
        doc["temperature_c"] = latestTankData.temperature_c;
        doc["pump_running"] = state;
        doc["pump_state"] = state ? "ON" : "OFF";
        doc["pump_mode"] = pumpMode;
        doc["current_amps"] = state ? (currentAmps > 0.0f ? currentAmps : 4.8f) : 0.0f;
        doc["runtime_seconds"] = totalRuntimeSeconds;
        doc["subnode_online"] = subNodeConnected;
        doc["rssi"] = WiFi.RSSI();
        doc["uptime_seconds"] = millis() / 1000;

        char buffer[512];
        serializeJson(doc, buffer);
        mqttClient.publish((String("devices/") + DEVICE_UID + "/telemetry").c_str(), buffer);
        mqttClient.publish((String("aquacontrol/") + DEVICE_UID + "/telemetry").c_str(), buffer);
    }
}

void triggerEmergencyStop(const char* reason, const char* cmdId) {
    systemFault = true;
    faultReason = reason;
    pumpState = false;
    digitalWrite(PIN_RELAY, HIGH);
    digitalWrite(PIN_LED_PUMP, LOW);
    digitalWrite(PIN_LED_FAULT, HIGH);

    for (int i = 0; i < 3; i++) {
        digitalWrite(PIN_BUZZER, HIGH); delay(150);
        digitalWrite(PIN_BUZZER, LOW);  delay(100);
    }

