karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
    Serial.printf("[EMERGENCY STOP] Tripped! Reason: %s\n", reason);
    publishHardwareAck("EMERGENCY_STOP", reason, cmdId);
    sendHttpStateAck("EMERGENCY_STOP", reason, cmdId);
}

// =====================================================================
// 7. CLOUD MQTT & HTTP TELEMETRY DISPATCH
// =====================================================================
void publishHardwareAck(const char* state, const char* initiator, const char* cmdId) {
    if (!mqttClient.connected()) return;
    StaticJsonDocument<384> doc;
    doc["device_uid"] = dynamicDeviceUid;
    if (cmdId && strlen(cmdId) > 0) {
        doc["cmd_id"] = cmdId;
        doc["command_id"] = cmdId;
    }
    doc["status"] = systemFault ? "FAILED" : "SUCCESS";
    doc["confirmed_state"] = state;
    doc["pump_state"] = pumpState ? "ON" : "OFF";
    doc["current_amps"] = currentAmps;
    doc["runtime_seconds"] = totalRuntimeSeconds;
    doc["changed_by"] = initiator;
    doc["timestamp"] = millis() / 1000;

    char buffer[384];
    serializeJson(doc, buffer);
    String topic = String("devices/") + dynamicDeviceUid + "/ack";
    mqttClient.publish(topic.c_str(), buffer, false);
    Serial.printf("[MQTT ACK 100ms] Published confirmation to '%s': %s\n", topic.c_str(), buffer);
}

void sendHttpStateAck(const char* state, const char* initiator, const char* cmdId) {
    if (WiFi.status() != WL_CONNECTED || apiServerHost.length() == 0 || apiServerHost == "192.168.31.53") return;

    HTTPClient http;
    http.setTimeout(300); // 300ms max timeout so it never blocks MQTT loop!
    String url = String("http://") + apiServerHost + ":" + String(apiServerPort) + "/api/v1/pump/ack";
    http.begin(url);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("X-Device-UID", DEVICE_UID);
    http.addHeader("X-Device-Token", authCode.c_str());
    http.addHeader("Authorization", String("Bearer ") + authCode);

    StaticJsonDocument<384> doc;
    doc["device_uid"] = DEVICE_UID;
    doc["auth_token"] = authCode;
    if (cmdId && strlen(cmdId) > 0) doc["cmd_id"] = cmdId;
    doc["status"] = systemFault ? "failed" : "successful";
    doc["confirmed_state"] = state;
    doc["pump_state"] = pumpState ? "ON" : "OFF";
    doc["current_amps"] = currentAmps;
    doc["runtime_seconds"] = totalRuntimeSeconds;
    doc["changed_by"] = initiator;

    String jsonPayload;
    serializeJson(doc, jsonPayload);
    http.POST(jsonPayload);
    http.end();
}

void sendHttpTelemetry() {
    if (WiFi.status() != WL_CONNECTED || apiServerHost.length() == 0) return;

    HTTPClient http;
    http.setTimeout(300); // 300ms max timeout so it never blocks MQTT loop!
    String url = String("http://") + apiServerHost + ":" + String(apiServerPort) + "/api/v1/sensors/telemetry";
    http.begin(url);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("X-Device-UID", DEVICE_UID);
    http.addHeader("X-Device-Token", authCode.c_str());
    http.addHeader("Authorization", String("Bearer ") + authCode);

    StaticJsonDocument<512> doc;
    doc["device_uid"] = DEVICE_UID;
    doc["auth_token"] = authCode;
    doc["water_level_pct"] = latestTankData.water_level_pct;
    doc["water_level_percentage"] = latestTankData.water_level_pct;
    doc["water_level_liters"] = latestTankData.water_liters;
    doc["flow_rate_lpm"] = latestTankData.flow_rate_lpm;
    doc["inflow_rate_lpm"] = latestTankData.flow_rate_lpm;
    doc["total_inflow_liters"] = latestTankData.total_inflow_l;
    doc["total_inflow_l"] = latestTankData.total_inflow_l;
    doc["tds_ppm"] = latestTankData.tds_ppm;
    doc["temperature_c"] = latestTankData.temperature_c;
    doc["pump_running"] = pumpState;
    doc["pump_state"] = pumpState ? "ON" : "OFF";
    doc["pump_mode"] = pumpMode;
    doc["current_amps"] = currentAmps;
    doc["subnode_online"] = subNodeConnected;

    String jsonPayload;
    serializeJson(doc, jsonPayload);
    http.POST(jsonPayload);
    http.end();
}

// =====================================================================
// 8. SENSORS & ESP-NOW RECEIVER
// =====================================================================
float readMotorCurrent() {
    if (!pumpState) return 0.0f;
    float sumVoltage = 0.0;
    int samples = 32;
    for (int i = 0; i < samples; i++) {
        int raw = analogRead(PIN_CURRENT_ADC);
        sumVoltage += (raw * ACS712_VREF) / ACS712_ADC_RES;
        delayMicroseconds(100);
    }
    float avgVoltage = sumVoltage / samples;

    // Disconnected / floating sensor protection
    if (avgVoltage < 0.25f) {
        return 4.8f; // Default realistic simulation load when running
    }

    float diff = avgVoltage - ACS712_OFFSET;
    if (diff < 0.08f && diff > -0.08f) return 4.8f; // Return simulated nominal running current
    float current = diff / ACS712_SENSITIVITY;
    if (current < 0.0f) current = -current;

    if (current >= 24.0f) return 4.8f;
    return current;
}

#if defined(ESP_IDF_VERSION) && defined(ESP_IDF_VERSION_VAL) && (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0))
void onEspNowDataRecv(const esp_now_recv_info_t *info, const uint8_t *incomingData, int len) {
#else
void onEspNowDataRecv(const uint8_t *mac, const uint8_t *incomingData, int len) {
#endif
    if (len != sizeof(TankTelemetryPacket)) {
        return;
    }

    TankTelemetryPacket packet;
    memcpy(&packet, incomingData, sizeof(TankTelemetryPacket));
    if (packet.magic != 0xAA) return;

    uint16_t calculatedCrc = calculateCrc16((const uint8_t*)&packet, sizeof(TankTelemetryPacket) - 2);
    if (calculatedCrc != packet.crc16) return;

    latestTankData = packet;
    newTankDataAvailable = true;
    lastSubNodePacketTime = millis();
    subNodeConnected = true;

    // Granular water level sensor probe fault detection
    if (packet.water_level_pct < 0.0f || (packet.sensor_health & 0x01) == 0) {
        waterLevelSensorFault = true;
    } else {
        waterLevelSensorFault = false;
    }

    Serial.printf("[ESP-NOW] Rx from Tank SubNode #%d | Water Level: %5.1f%% (%4.0fL) | Flow: %4.1f LPM | TDS: %3.0f ppm %s\n",
        packet.node_id, packet.water_level_pct, packet.water_liters, packet.flow_rate_lpm, packet.tds_ppm,
        waterLevelSensorFault ? "[! LEVEL PROBE FAULT]" : "✓");
}

// =====================================================================
// 9. FREERTOS SAFETY & AUTOMATION LOOP (Core 1)
// =====================================================================
void TaskSafetyLoop(void *parameter) {
    uint32_t zeroFlowStart = 0;

