karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
    for (;;) {
        currentAmps = readMotorCurrent();
        if (pumpState && currentAmps > 15.0) {
            triggerEmergencyStop("Motor Overcurrent Detected (>15A)");
        }

        if (pumpState) {
            totalRuntimeSeconds = (millis() - pumpStartMillis) / 1000;
            if (totalRuntimeSeconds > MAX_RUNTIME_LIMIT_S) {
                triggerEmergencyStop("Max Continuous Runtime Exceeded (2 Hours)");
            }
        }

        // Autonomous Edge Automation Rules (Strict Dynamic Evaluation from Configured Rules)
        if (!systemFault && pumpMode == "AUTOMATIC") {
            float currentWaterLevel = latestTankData.water_level_pct;
            bool isLevelValid = subNodeConnected && !waterLevelSensorFault && currentWaterLevel >= 0.0f;

            if (dynamicRuleCount > 0) {
                // Strictly evaluate ONLY user-configured dynamic rules
                for (uint8_t i = 0; i < dynamicRuleCount; i++) {
                    if (!dynamicRules[i].enabled) continue;

                    // 1. Level Less Than Condition (e.g. Start <= 20% or user configured threshold, even if level is 0%)
                    if (isLevelValid && dynamicRules[i].level_lt >= 0.0f && currentWaterLevel <= dynamicRules[i].level_lt) {
                        if (strcmp(dynamicRules[i].action, "START") == 0 && !pumpState) {
                            Serial.printf("[EDGE AUTO] ✓ Rule '%s' matched (Level %.1f%% <= %.1f%%) -> STARTING PUMP\n",
                                dynamicRules[i].rule_name, currentWaterLevel, dynamicRules[i].level_lt);
                            setPumpState(true, dynamicRules[i].rule_name);
                            break;
                        }
                    }

                    // 2. Level Greater Than Condition (e.g. Stop >= 99% or exact user configured threshold)
                    if (isLevelValid && dynamicRules[i].level_gt >= 0.0f && currentWaterLevel >= dynamicRules[i].level_gt) {
                        if (strcmp(dynamicRules[i].action, "STOP") == 0 && pumpState) {
                            Serial.printf("[EDGE AUTO] ✓ Rule '%s' matched (Level %.1f%% >= %.1f%%) -> STOPPING PUMP (User Threshold Reached)\n",
                                dynamicRules[i].rule_name, currentWaterLevel, dynamicRules[i].level_gt);
                            setPumpState(false, dynamicRules[i].rule_name);
                            break;
                        }
                    }

                    // 3. Dry Run / Zero Flow Protection
                    if (dynamicRules[i].no_flow_sec > 0 && pumpState && (millis() - pumpStartMillis > 20000)) {
                        if (latestTankData.flow_rate_lpm < 0.5 && subNodeConnected) {
                            if (zeroFlowStart == 0) zeroFlowStart = millis();
                            if (millis() - zeroFlowStart > (dynamicRules[i].no_flow_sec * 1000)) {
                                triggerEmergencyStop(dynamicRules[i].rule_name);
                                break;
                            }
                        } else {
                            zeroFlowStart = 0;
                        }
                    }
                }
            } else {
                // Default fallback ONLY when NO user rules exist:
                if (isLevelValid && currentWaterLevel <= 30.0f && !pumpState) {
                    Serial.printf("[EDGE AUTO] Default Fallback: Level %.1f%% <= 30%% -> STARTING PUMP\n", currentWaterLevel);
                    setPumpState(true, "Default Fallback (<30%)");
                } else if (isLevelValid && currentWaterLevel >= 95.0f && pumpState) {
                    Serial.printf("[EDGE AUTO] Default Fallback: Level %.1f%% >= 95%% -> STOPPING PUMP\n", currentWaterLevel);
                    setPumpState(false, "Default Fallback (>=95%)");
                }
            }
        }

        vTaskDelay(pdMS_TO_TICKS(50));
    }
}

// =====================================================================
// 10. FREERTOS NETWORKING & MQTT LOOP (Core 0)
// =====================================================================
void onMqttMessage(char* topic, byte* payload, unsigned int length) {
    digitalWrite(PIN_LED_WIFI, HIGH); // Visual telemetry activity indicator

    StaticJsonDocument<1024> doc;
    DeserializationError error = deserializeJson(doc, payload, length);
    
    String action = "";
    String cmdId = "";
    String initiator = "MQTT_CLOUD";

    if (!error) {
        action = String(doc["command"] | doc["action"] | doc["command_type"] | doc["state"] | "");
        cmdId = String(doc["cmd_id"] | doc["command_id"] | "");
        initiator = String(doc["source"] | doc["initiator"] | "MQTT_COMMAND");
    } else {
        // Fallback: parse raw string payload
        char rawStr[64];
        size_t copyLen = length < 63 ? length : 63;
        memcpy(rawStr, payload, copyLen);
        rawStr[copyLen] = '\0';
        action = String(rawStr);
        action.trim();
    }

    String cmdAuth = doc["auth_code"] | doc["payload"]["auth_code"] | doc["user_auth_id"] | doc["auth_token"] | doc["auth"] | "";

    // 1. Strict Security Barrier: Reject commands from mismatched/unauthorized accounts
    if (authCode != "UNPROVISIONED" && authCode.length() > 0) {
        bool isClaimCmd = action.equalsIgnoreCase("SET_AUTH_CODE") || action.equalsIgnoreCase("CLAIM_DEVICE") || action.equalsIgnoreCase("LINK_ACCOUNT");
        if (!isClaimCmd && cmdAuth.length() > 0 && cmdAuth != authCode && cmdAuth != "WPC_AUTH_SECURE_KEY_2026") {
            Serial.printf("[SECURITY BLOCKED] Rejecting command '%s' from unauthorized Auth Code '%s' (Device locked to '%s')\n",
                action.c_str(), cmdAuth.c_str(), authCode.c_str());
            publishHardwareAck(pumpState ? "ON" : "OFF", "UNAUTHORIZED_ACCOUNT_BLOCKED", cmdId.c_str());
            return;
        }
    }

    Serial.printf("[MQTT] Inbound Command on '%s': '%s' (cmd_id: '%s', auth: '%s')\n", topic, action.c_str(), cmdId.c_str(), cmdAuth.c_str());

    if (action.equalsIgnoreCase("START") || action.equalsIgnoreCase("START_PUMP") || action.equalsIgnoreCase("ON")) {
        systemFault = false;
        digitalWrite(PIN_LED_FAULT, LOW);
        if (doc.containsKey("mode")) {
            pumpMode = doc["mode"].as<String>();
        } else if (doc["payload"].containsKey("mode")) {
            pumpMode = doc["payload"]["mode"].as<String>();
        } else if (initiator.indexOf("AUTO") != -1 || initiator.indexOf("RULE") != -1 || initiator.indexOf("SYSTEM_AUTOMATION") != -1) {
            pumpMode = "AUTOMATIC";
        }
        setPumpState(true, initiator.c_str(), cmdId.c_str());
    } else if (action.equalsIgnoreCase("STOP") || action.equalsIgnoreCase("STOP_PUMP") || action.equalsIgnoreCase("OFF")) {
        if (doc.containsKey("mode")) {
            pumpMode = doc["mode"].as<String>();
        } else if (doc["payload"].containsKey("mode")) {
            pumpMode = doc["payload"]["mode"].as<String>();
        }
        setPumpState(false, initiator.c_str(), cmdId.c_str());
    } else if (action.equalsIgnoreCase("SET_MODE")) {
        pumpMode = doc["mode"] | doc["payload"]["mode"] | "AUTOMATIC";
        Serial.printf("[MQTT] Pump Mode set to: %s\n", pumpMode.c_str());
        publishHardwareAck(pumpState ? "ON" : "OFF", initiator.c_str(), cmdId.c_str());
    } else if (action.equalsIgnoreCase("SYNC_RULES") || action.equalsIgnoreCase("SET_RULES") || action.equalsIgnoreCase("UPDATE_RULES")) {
        JsonArray rulesArr;
        if (doc.containsKey("rules")) {
            rulesArr = doc["rules"].as<JsonArray>();
        } else if (doc["payload"].containsKey("rules")) {
            rulesArr = doc["payload"]["rules"].as<JsonArray>();
        }
        
