karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
        dynamicRuleCount = 0; // Reset rules table immediately
        for (JsonObject r : rulesArr) {
            if (dynamicRuleCount >= MAX_DYNAMIC_RULES) break;
            
            String rId = r["id"] | "";
            String rName = r["rule_name"] | r["name"] | "Rule";
            bool rEnabled = r.containsKey("enabled") ? bool(r["enabled"]) : true;
            uint8_t rPriority = r["priority"] | 1;
            
            JsonObject cond = r["condition_json"].is<JsonObject>() ? r["condition_json"].as<JsonObject>() : r["condition"].as<JsonObject>();
            JsonObject act = r["action_json"].is<JsonObject>() ? r["action_json"].as<JsonObject>() : r["action"].as<JsonObject>();
            
            float lt = -1.0f;
            float gt = -1.0f;
            uint16_t nf = 0;
            
            if (cond.containsKey("level_lt")) lt = cond["level_lt"].as<float>();
            else if (cond.containsKey("level_lte")) lt = cond["level_lte"].as<float>();
            else if (cond.containsKey("level_min")) lt = cond["level_min"].as<float>();
            
            if (cond.containsKey("level_gt")) gt = cond["level_gt"].as<float>();
            else if (cond.containsKey("level_gte")) gt = cond["level_gte"].as<float>();
            else if (cond.containsKey("level_max")) gt = cond["level_max"].as<float>();
            
            if (cond.containsKey("no_flow_timeout_seconds")) nf = cond["no_flow_timeout_seconds"].as<uint16_t>();
            
            String actStr = act["pump_action"] | act["action"] | "START";
            
            strncpy(dynamicRules[dynamicRuleCount].id, rId.c_str(), sizeof(dynamicRules[dynamicRuleCount].id) - 1);
            strncpy(dynamicRules[dynamicRuleCount].rule_name, rName.c_str(), sizeof(dynamicRules[dynamicRuleCount].rule_name) - 1);
            strncpy(dynamicRules[dynamicRuleCount].action, actStr.c_str(), sizeof(dynamicRules[dynamicRuleCount].action) - 1);
            dynamicRules[dynamicRuleCount].enabled = rEnabled;
            dynamicRules[dynamicRuleCount].level_lt = lt;
            dynamicRules[dynamicRuleCount].level_gt = gt;
            dynamicRules[dynamicRuleCount].no_flow_sec = nf;
            dynamicRules[dynamicRuleCount].priority = rPriority;
            
            dynamicRuleCount++;
        }
        saveRulesToNvs();
        Serial.printf("[MQTT] ✓ Synced %d dynamic rules to Edge Hardware Memory & NVS\n", dynamicRuleCount);
        publishHardwareAck(pumpState ? "ON" : "OFF", "RULES_SYNCED", cmdId.c_str());
    } else if (action.equalsIgnoreCase("EMERGENCY_STOP") || action.equalsIgnoreCase("ESTOP")) {
        triggerEmergencyStop("Remote Cloud E-Stop Command", cmdId.c_str());
    } else if (action.equalsIgnoreCase("SET_AUTH_CODE") || action.equalsIgnoreCase("CLAIM_DEVICE") || action.equalsIgnoreCase("LINK_ACCOUNT")) {
        String newAuth = doc["auth_code"] | doc["payload"]["auth_code"] | doc["user_auth_id"] | "";
        if (newAuth.length() > 0) {
            authCode = newAuth;
            preferences.putString("auth_code", authCode);
            Serial.printf("[MQTT] ✓ Hardware Account Re-linked! New Auth Code: %s\n", authCode.c_str());
            publishHardwareAck(pumpState ? "ON" : "OFF", "ACCOUNT_LINKED", cmdId.c_str());
        }
    } else if (action.equalsIgnoreCase("CLEAR_FAULT") || action.equalsIgnoreCase("RESET_FAULT") || action.equalsIgnoreCase("RESET_LOCKOUT") || action.equalsIgnoreCase("RESET")) {
        systemFault = false;
        digitalWrite(PIN_LED_FAULT, LOW);
        publishHardwareAck("OFF", "FAULT_CLEARED", cmdId.c_str());
    } else if (action.equalsIgnoreCase("RELEASE_AUTH") || action.equalsIgnoreCase("UNLINK_ACCOUNT") || action.equalsIgnoreCase("RELEASE_OWNERSHIP")) {
        preferences.begin("pump_cfg", false);
        preferences.putString("auth_code", "UNPROVISIONED");
        preferences.end();
        authCode = "UNPROVISIONED";
        Serial.println("[MQTT] ✓ Hardware Ownership Released! Auth Code reset to UNPROVISIONED. Ready for new account link.");
        publishHardwareAck(pumpState ? "ON" : "OFF", "AUTH_RELEASED", cmdId.c_str());
    } else if (action.equalsIgnoreCase("FACTORY_RESET") || action.equalsIgnoreCase("RESET_AUTH") || action.equalsIgnoreCase("UNLINK_HARDWARE") || action.equalsIgnoreCase("DELETE_DEVICE")) {
        preferences.begin("pump_cfg", false);
        preferences.clear();
        preferences.end();
        authCode = "UNPROVISIONED";
        wifiSsid = "";
        wifiPass = "";
        Serial.println("[MQTT] ✓ Factory Reset Triggered! Cleared Auth Code and Wi-Fi credentials from NVS Flash.");
        publishHardwareAck("OFF", "FACTORY_RESET_COMPLETE", cmdId.c_str());
        delay(300);
        ESP.restart();
    } else if (action.equalsIgnoreCase("PING")) {
        publishHardwareAck(pumpState ? "ON" : "OFF", "PONG", cmdId.c_str());
    }
}

void TaskNetworkLoop(void *parameter) {
    uint32_t lastTelemetryPublish = 0;
    uint32_t lastHttpTelemetryTime = 0;

    for (;;) {
        // 1. Process Captive Portal DNS & HTTP requests
        dnsServer.processNextRequest();
        localServer.handleClient();

        // 2. Wi-Fi Connection State Machine
        wl_status_t currentStatus = WiFi.status();
        if (currentStatus == WL_CONNECTED) {
            if (!wifiConnected) {
                wifiConnected = true;
                Serial.printf("[WiFi STA] ✓ Connected! IP: %s | Gateway: %s | RSSI: %d dBm\n",
                    WiFi.localIP().toString().c_str(), WiFi.gatewayIP().toString().c_str(), WiFi.RSSI());
            }
        } else {
            if (wifiConnected) {
                wifiConnected = false;
                Serial.printf("[WiFi STA] Connection lost. Status: %s (%d)\n",
                    getWifiStatusText(currentStatus), currentStatus);
            }
            if (wifiSsid.length() > 0 && millis() - lastWifiCheck > 10000) {
                lastWifiCheck = millis();
                Serial.printf("[WiFi STA] Connecting to '%s' (Current Status: %s [%d])...\n",
                    wifiSsid.c_str(), getWifiStatusText(currentStatus), currentStatus);
                WiFi.disconnect(false);
                delay(50);
                WiFi.setSleep(false);
                WiFi.setAutoReconnect(true);
                WiFi.begin(wifiSsid.c_str(), wifiPass.c_str());
            }
        }

