karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
        // 3. MQTT Connection & Dual-Channel Telemetry Sync
        if (wifiConnected) {
            if (!mqttClient.connected()) {
                if (millis() - lastMqttCheck > 3000) {
                    lastMqttCheck = millis();
                    mqttClient.setServer(mqttBroker.c_str(), mqttPort);
                    mqttClient.setCallback(onMqttMessage);
                    mqttClient.setBufferSize(1024);
                    mqttClient.setKeepAlive(15);

                    String clientId = String("ESP32_HW_") + dynamicDeviceUid;
                    String lwtTopic1 = String("devices/") + dynamicDeviceUid + "/status";
                    String lwtTopic2 = String("aquacontrol/") + dynamicDeviceUid + "/status";
                    String lwtTopic3 = String("aquacontrol/v1/devices/") + dynamicDeviceUid + "/status";
                    String lwtPayload = "{\"status\":\"offline\",\"device_uid\":\"" + dynamicDeviceUid + "\"}";

                    Serial.printf("[MQTT] Connecting to '%s:%d' (Client: %s)...\n",
                        mqttBroker.c_str(), mqttPort, clientId.c_str());

                    // Connect with clean session and LWT
                    bool conn = mqttClient.connect(clientId.c_str(), lwtTopic1.c_str(), 0, false, lwtPayload.c_str());
                    if (!conn && authCode.length() > 0) {
                        conn = mqttClient.connect(clientId.c_str(), dynamicDeviceUid.c_str(), authCode.c_str(), lwtTopic1.c_str(), 0, false, lwtPayload.c_str());
                    }

                    if (conn) {
                        mqttConnected = true;
                        Serial.println("[MQTT] ✓ Connected to Cloud MQTT Broker!");

                        // Publish instant online & hardware state sync message on all topics
                        String onlinePayload = "{\"status\":\"online\",\"device_uid\":\"" + String(DEVICE_UID) + "\",\"ip\":\"" + WiFi.localIP().toString() + "\",\"rssi\":" + String(WiFi.RSSI()) + ",\"pump_state\":\"" + (pumpState ? "ON" : "OFF") + "\",\"pump_running\":" + (pumpState ? "true" : "false") + ",\"pump_mode\":\"" + pumpMode + "\",\"current_amps\":" + String(currentAmps, 2) + "}";
                        mqttClient.publish(lwtTopic1.c_str(), onlinePayload.c_str(), true);
                        mqttClient.publish(lwtTopic2.c_str(), onlinePayload.c_str(), true);
                        mqttClient.publish(lwtTopic3.c_str(), onlinePayload.c_str(), true);

                        // Broadcast immediate boot hardware ACK to reconcile web app state on reboot
                        publishHardwareAck(pumpState ? "ON" : "OFF", "BOOT_RESTART_SYNC", "boot_sync_001");

                        // Subscribe to pump commands on all namespaces
                        String cmdTopic1 = String("devices/") + DEVICE_UID + "/commands";
                        String cmdTopic2 = String("aquacontrol/") + DEVICE_UID + "/commands";
                        String cmdTopic3 = String("aquacontrol/v1/devices/") + DEVICE_UID + "/commands";
                        mqttClient.subscribe(cmdTopic1.c_str(), 0);
                        mqttClient.subscribe(cmdTopic2.c_str(), 0);
                        mqttClient.subscribe(cmdTopic3.c_str(), 0);
                        Serial.printf("[MQTT] Subscribed to: '%s', '%s', '%s'\n", cmdTopic1.c_str(), cmdTopic2.c_str(), cmdTopic3.c_str());
                    } else {
                        mqttConnected = false;
                        Serial.printf("[MQTT] Connection attempt failed (rc=%d). Retrying in 3s...\n", mqttClient.state());
                    }
                }
            } else {
                mqttConnected = true;
                mqttClient.loop();

                // Publish Ultra-Fast Telemetry over MQTT every 100ms (10Hz Real-Time Stream)
                static uint32_t packetCounter = 0;
                if (millis() - lastTelemetryPublish >= 100) {
                    lastTelemetryPublish = millis();
                    packetCounter++;

                    // Sub-Node Connection Timeout Watchdog (2.5s)
                    if (millis() - lastSubNodePacketTime > 2500 || lastSubNodePacketTime == 0) {
                        subNodeConnected = false;
                        waterLevelSensorFault = false;
                    }

                    // Check individual sensor status
                    bool isLevelGood = subNodeConnected && !waterLevelSensorFault && latestTankData.water_level_pct >= 0.0f;
                    float levelOut = isLevelGood ? latestTankData.water_level_pct : 0.0f;
                    float litersOut = isLevelGood ? latestTankData.water_liters : 0.0f;
                    float flowOut = subNodeConnected ? latestTankData.flow_rate_lpm : 0.0f;
                    float totalFlowOut = subNodeConnected ? latestTankData.total_inflow_l : 0.0f;
                    float tdsOut = subNodeConnected ? latestTankData.tds_ppm : 0.0f;

                    StaticJsonDocument<768> doc;
                    doc["device_uid"] = dynamicDeviceUid;
                    doc["timestamp"] = millis() / 1000;
                    doc["water_level_percentage"] = levelOut;
                    doc["water_level_pct"] = levelOut;
                    doc["water_level_liters"] = litersOut;
                    doc["flow_rate_lpm"] = flowOut;
                    doc["inflow_rate_lpm"] = flowOut;
                    doc["total_liters"] = totalFlowOut;
                    doc["total_inflow_liters"] = totalFlowOut;
                    doc["tds_ppm"] = tdsOut;
                    doc["temperature_c"] = latestTankData.temperature_c;
                    doc["pump_running"] = pumpState;
                    doc["pump_state"] = pumpState ? "ON" : "OFF";
                    doc["pump_mode"] = pumpMode;
                    doc["current_amps"] = currentAmps;
                    doc["runtime_seconds"] = totalRuntimeSeconds;
                    doc["subnode_online"] = subNodeConnected;
                    doc["ultrasonic_online"] = isLevelGood;
                    doc["sensor_status"] = !subNodeConnected ? "SUBNODE_DISCONNECTED" : (waterLevelSensorFault ? "ULTRASONIC_FAULT" : "HEALTHY");
                    doc["rssi"] = WiFi.RSSI();
                    doc["uptime_seconds"] = millis() / 1000;

                    char buffer[768];
                    serializeJson(doc, buffer);
                    String topic = String("devices/") + dynamicDeviceUid + "/telemetry";
                    mqttClient.publish(topic.c_str(), buffer, false);

                    if (packetCounter % 20 == 0) {
                        Serial.printf("[MQTT 100ms] Tank: %5.1f%% (%4.0fL) | Flow: %4.1f LPM | Pump: %s | Status: %s\n",
                            levelOut, litersOut, flowOut, pumpState ? "ON" : "OFF",
                            !subNodeConnected ? "NO_SUBNODE" : (waterLevelSensorFault ? "LEVEL_FAULT" : "OK"));
                    }
                }
            }

            // High-speed MQTT event processing loop
        } else {
            mqttConnected = false;
        }

        vTaskDelay(pdMS_TO_TICKS(2));
    }
}

// =====================================================================
// 11. ARDUINO SETUP & MAIN LOOP
// =====================================================================
void setup() {
    Serial.begin(115200);
    delay(400);

    Serial.println("\n==================================================");
    Serial.println("  AQUACONTROL — ESP32 MAIN CONTROLLER v2.2.0");
    Serial.println("  Universal MQTT + Captive Portal + BLE Enabled");
    Serial.println("==================================================");

    // GPIO Configuration
    pinMode(PIN_RELAY, OUTPUT);
    digitalWrite(PIN_RELAY, HIGH); // De-energize relay on boot (Active LOW)

    pinMode(PIN_LED_POWER, OUTPUT);
    pinMode(PIN_LED_PUMP, OUTPUT);
    pinMode(PIN_LED_WIFI, OUTPUT);
    pinMode(PIN_LED_FAULT, OUTPUT);
    pinMode(PIN_BUZZER, OUTPUT);
    pinMode(PIN_BTN_MANUAL, INPUT_PULLUP);
    pinMode(PIN_BTN_RESET, INPUT_PULLUP);

    digitalWrite(PIN_LED_POWER, HIGH); // Blue Power LED ON

