karthiknataraj547/Smart-water-pump-controller/firmware/arduino-ide-sketches/ESP32_Main_Node/ESP32_Main_Node.ino
    mqttClient.setBufferSize(1024);
    mqttClient.setKeepAlive(15);

    // 1. Initialize Dynamic Hardware UID from Silicon eFuse MAC
    WiFi.mode(WIFI_AP_STA);
    initHardwareDeviceUid();

    // 2. Load Saved Credentials from NVS Flash
    loadSavedCredentials();

    // 3. Start Standard ESP32 BLE GATT Server
    startBleProvisioning();

    // 4. Start Wi-Fi Hotspot with unique hardware-derived SSID
    String dynamicApSsid = "AquaControl-" + dynamicDeviceUid.substring(4);
    WiFi.softAP(dynamicApSsid.c_str(), PROVISION_AP_PASS);
    Serial.printf("[WiFi AP] SoftAP Hotspot Active: '%s' (Pass: '%s') -> IP: %s\n",
        dynamicApSsid.c_str(), PROVISION_AP_PASS, WiFi.softAPIP().toString().c_str());

    // 5. Start Captive Portal DNS Server (Redirects all DNS queries to 192.168.4.1)
    dnsServer.start(53, "*", WiFi.softAPIP());

    // 6. Setup Local REST Server & Captive Portal Web Page
    setupHttpEndpoints();

    // 6. Connect to saved Wi-Fi if available
    if (wifiSsid.length() > 0) {
        Serial.printf("[WiFi STA] Connecting to saved Wi-Fi '%s'...\n", wifiSsid.c_str());
        WiFi.setSleep(false);
        WiFi.setAutoReconnect(true);
        WiFi.begin(wifiSsid.c_str(), wifiPass.c_str());
    } else {
        Serial.println("[WiFi STA] No saved Wi-Fi. Connect to 'AquaControl-Setup' or use BLE/Serial to configure.");
    }

    // 7. Initialize ESP-NOW 2.4GHz Link Receiver
    if (esp_now_init() == ESP_OK) {
        esp_now_register_recv_cb(onEspNowDataRecv);

        esp_now_peer_info_t broadcastPeer = {};
        memset(&broadcastPeer, 0, sizeof(broadcastPeer));
        for (int i = 0; i < 6; i++) broadcastPeer.peer_addr[i] = 0xFF;
        broadcastPeer.channel = 0;
        broadcastPeer.encrypt = false;
        esp_now_add_peer(&broadcastPeer);

        Serial.println("[ESP-NOW] Direct 2.4GHz Link Receiver Initialized & Armed!");
    }

    // 8. FreeRTOS Dual-Core Tasks (High Priority Real-time Networking)
    xTaskCreatePinnedToCore(TaskSafetyLoop,  "TaskSafety",  4096, NULL, 5, &TaskSafetyHandle,  1); // Core 1 (Safety & Automation)
    xTaskCreatePinnedToCore(TaskNetworkLoop, "TaskNetwork", 8192, NULL, 4, &TaskNetworkHandle, 0); // Core 0 (Priority 4 Real-time MQTT)
}

void loop() {
    // =================================================================
    // 1. WI-FI & MQTT LED STATUS INDICATION
    // =================================================================
    // When connected to Wi-Fi: Solid ON
    // When connecting / searching: Blinks every 500ms
    if (WiFi.status() == WL_CONNECTED) {
        digitalWrite(PIN_LED_WIFI, HIGH);
    } else {
        if (millis() - lastLedBlinkTime >= 500) {
            lastLedBlinkTime = millis();
            ledWifiState = !ledWifiState;
            digitalWrite(PIN_LED_WIFI, ledWifiState ? HIGH : LOW);
        }
    }

    // =================================================================
    // 2. MANUAL PHYSICAL PUSH BUTTON TOGGLE
    // =================================================================
    static uint32_t lastBtnCheck = 0;
    if (millis() - lastBtnCheck > 200) {
        lastBtnCheck = millis();
        if (digitalRead(PIN_BTN_MANUAL) == LOW) {
            setPumpState(!pumpState, "PHYSICAL_BUTTON_PRESS");
            delay(300);
        }
    }

    // =================================================================
    // 3. RESET BUTTON (Hold 3s to wipe credentials)
    // =================================================================
    static uint32_t resetHoldStart = 0;
    if (digitalRead(PIN_BTN_RESET) == LOW) {
        if (resetHoldStart == 0) resetHoldStart = millis();
        if (millis() - resetHoldStart >= 3000) {
            resetHoldStart = 0;
            Serial.println("[RESET] Clearing Wi-Fi credentials from NVS flash...");
            preferences.begin("pump_cfg", false);
            preferences.clear();
            preferences.end();
            
            digitalWrite(PIN_BUZZER, HIGH); delay(300); digitalWrite(PIN_BUZZER, LOW);
            Serial.println("[RESET] Rebooting into Provisioning Mode...");
            ESP.restart();
        }
    } else {
        resetHoldStart = 0;
    }

    // =================================================================
    // 4. USB SERIAL COMMANDS & PROVISIONING
    // =================================================================
    if (Serial.available() > 0) {
        String serialInput = Serial.readStringUntil('\n');
        serialInput.trim();
        if (serialInput.equalsIgnoreCase("RESET") || serialInput.equalsIgnoreCase("FACTORY_RESET")) {
            preferences.begin("pump_cfg", false);
            preferences.clear();
            preferences.end();
            digitalWrite(PIN_BUZZER, HIGH); delay(300); digitalWrite(PIN_BUZZER, LOW);
            Serial.println("[RESET] Reset Complete! Rebooting...");
            ESP.restart();
        } else if (serialInput.equalsIgnoreCase("SCAN") || serialInput.equalsIgnoreCase("WIFI_SCAN")) {
            Serial.println("[WIFI] Scanning available networks...");
            int n = WiFi.scanNetworks();
            for (int i = 0; i < n; ++i) {
                Serial.printf("  [%d] %s (RSSI: %d dBm) %s\n",
                    i+1, WiFi.SSID(i).c_str(), WiFi.RSSI(i), WiFi.encryptionType(i) == WIFI_AUTH_OPEN ? "[OPEN]" : "[SECURED]");
            }
        } else if (serialInput.startsWith("WIFI:") || serialInput.startsWith("wifi:")) {
            // Quick Format: WIFI:SSID:Password:broker.emqx.io
            int firstColon = serialInput.indexOf(':', 5);
            if (firstColon > 0) {
                String s = serialInput.substring(5, firstColon);
                int secondColon = serialInput.indexOf(':', firstColon + 1);
                String p = (secondColon > 0) ? serialInput.substring(firstColon + 1, secondColon) : serialInput.substring(firstColon + 1);
                String b = (secondColon > 0) ? serialInput.substring(secondColon + 1) : DEFAULT_MQTT_BROKER;
                Serial.printf("[SERIAL] Setting Wi-Fi: SSID='%s', Pass='%s', Broker='%s'\n", s.c_str(), p.c_str(), b.c_str());
                wifiSsid = s;
                wifiPass = p;
                mqttBroker = b;
                saveCredentials(wifiSsid, wifiPass, mqttBroker, mqttPort, apiServerHost, apiServerPort, authCode);
                WiFi.disconnect(false);
                WiFi.begin(wifiSsid.c_str(), wifiPass.c_str());
            }
        } else if (serialInput.startsWith("{") && serialInput.endsWith("}")) {
            handleApplyCredentials(serialInput);
        }
    }

    vTaskDelay(pdMS_TO_TICKS(50));
}
